pruebas/results/2025-11-11_00-24-39/S0_master_wo_t4.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 128.68 qps: 773.18 (r/w/o: 0.00/515.42/257.76) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 117.70 qps: 705.62 (r/w/o: 0.00/470.21/235.41) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 114.60 qps: 687.89 (r/w/o: 0.00/458.70/229.20) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 118.30 qps: 711.00 (r/w/o: 0.00/474.40/236.60) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 117.00 qps: 701.61 (r/w/o: 0.00/467.60/234.00) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 115.60 qps: 694.00 (r/w/o: 0.00/462.80/231.20) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           28492
        other:                           14246
        total:                           42738
    transactions:                        7123   (118.68 per sec.)
    queries:                             42738  (712.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0153s
    total number of events:              7123

Latency (ms):
         min:                                    6.21
         avg:                                   33.70
         max:                                  142.95
         95th percentile:                       56.84
         sum:                               240011.75

Threads fairness:
    events (avg/stddev):           1780.7500/11.67
    execution time (avg/stddev):   60.0029/0.00