pruebas/results/2025-11-11_00-24-39/S0_master_wo_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 164.37 qps: 989.13 (r/w/o: 0.00/659.59/329.54) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 159.00 qps: 952.41 (r/w/o: 0.00/634.41/318.00) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 164.50 qps: 987.49 (r/w/o: 0.00/658.49/329.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 149.10 qps: 895.32 (r/w/o: 0.00/597.11/298.21) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 163.10 qps: 978.00 (r/w/o: 0.00/651.80/326.20) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 157.50 qps: 946.01 (r/w/o: 0.00/631.00/315.00) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           38336
        other:                           19168
        total:                           57504
    transactions:                        9584   (159.65 per sec.)
    queries:                             57504  (957.92 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0285s
    total number of events:              9584

Latency (ms):
         min:                                    6.74
         avg:                                   50.09
         max:                                  491.60
         95th percentile:                       77.19
         sum:                               480107.89

Threads fairness:
    events (avg/stddev):           1198.0000/10.27
    execution time (avg/stddev):   60.0135/0.01